{
  "title" : "7 subjects (and GitHub repositories) to become a better Go Developer",
  "date" : "2021-07-11T00:00:00+00:00",
  "tags" : [ ],
  "url" : "https://avelino.run/7-subjects-and-github-repositories-to-become-a-better-go-developer",
  "content" : "With the high adoption of the Go language by developers and large companies, this has led companies to search for engineers with experience in Go.\n\nThis can create a lot of pressure of what to study to become a better engineer, this is very personal, it requires planning of what and when to study other subjects (even outside the engineering area).\n\nIn this blogpost some topics (with repositories and links) that I think are important to know in order to become an engineer person with even better Go knowledge, follow good practices for writing code, concepts of code structure (usually using design pattern), scalable code and clean code.\n\nStyle guide\n\nI can't list only one link (repository) for this topic, I would recommend you to read for these 3 links and bring to your team's day to day life what best fits their reality — remember to use as base the official language documentation and add what makes sense from the other links\n\nEffective Go\n\n{{< github uber-go/guide >}}\n\nGoogle Style Guides\n\nGo standards and style guidelines | GitLab\n\nBest Practices\n\nFrancesc Campoy gave an excellent talk at OSCON 2015 on this subject, where he covered best practices for developing software using the Go language.\n\n{{< youtube 8D3Vmm1BGoY >}}\n\nSlides\n\nTwelve Go Best Practices\n\nAlgorithms Implemented\n\n{{< github TheAlgorithms/Go >}}\n\nThis repository contains Go based examples of many popular algorithms and data structures.\n\nEach algorithm and data structure has its own separate README with related explanations and links for further reading.\n\nClean Code\n\nA reference for the Go community that covers the fundamentals of writing clean code and discusses concrete refactoring examples specific to Go.\n\n{{< github Pungyeon/clean-go-article >}}\n\nClean Architecture\n\nIn his book “Clean Architecture: A Craftsman’s Guide to Software Structure and Design” famous author Robert “Uncle Bob” Martin presents an architecture with some important points like testability and independence of frameworks, databases and interfaces.\n\n{{< github bxcodec/go-clean-arch >}}\n\nElton Minetto has written two excellent blogposts on the subject:\n\n1. Clean Architecture using Golang\n2. Clean Architecture, 2 years later\n\nAwesome Go\n\nI couldn't leave out the awesome-go project (which I started in 2014 and today many contributors help me maintain)\n\n{{< github avelino/awesome-go >}}\n\nA collection of awesome Go libraries and resources. This repository contains a list of variety of frameworks, template engines, articles and post, documentations, reactive and functional programming and much more which will increase your resourcefulness and might also help you to choose the tech stack for your next projects.\n\nProject Guideline\n\nThis is a complicated subject, there is no standard that will work perfectly for what you are developing, I recommend understanding the concept of project architecture (not only Go) and together with your team understand what works for you, even though there are thousands of books to give you knowledge about the subject I recommend putting your hands in the code and allow you to make mistakes, it is the best way to evolve.\n\nRead this content before any other\n\nHow to Write Go Code\n\nNow that you have read the previous link I will recommend a controversial repository by its name, it is not Golang standards project layout, but there is a project structure that can help in the development of a new project - understand what makes sense for you (and your team), what doesn't, just ignore it.\n\n{{< github golang-standards/project-layout >}}\n\n> Read why I said this project is controversial\n\n----\n\nVote Of Thanks\n\nThank you so much for reading this post and I hope you find these repositories as useful as I do and will help you to become better go developer. Feel Free to give any suggestions and if you like my work you can follow me on Twitter",
  "type" : "blog",
  "file-path" : "content/blog/2021-07-11-7-subjects-and-github-repositories-to-become-a-better-go-developer.md"
}