{
  "title" : "Decisões na carreira de engenharia de software (desenvolvimento)",
  "date" : "2021-06-18T00:00:00+00:00",
  "tags" : [ ],
  "url" : "https://avelino.run/decisoes-na-carreira-de-engenharia-de-software-desenvolvimento",
  "content" : "> Ao decidir sobre qual passo seguirá em sua trajetória profissional, acredito que vale pena considerar os seguintes fatores (1). Dependendo do seu momento  de pessoal e/ou profissional, diferentes fatores será mais (ou menos) importantes (2).\n\nImportante:\n\n1. Assumi-se que você achou melhor se juntar, ao invés de criar (começar uma empresa). Não estou falando de fundar ou não uma empresa, e sim desmitificar auxiliar que queira entrar em uma empresa existente e é parcial com pessoas no início da carreira.\n\n2. Algumas coisas se torna mais importantes à medida que temos filhos, ajudar membros da família ou qualquer outro ponto relacionado que seja importante para seu momento pessoal. Para algumas pessoas, o trabalho ideal é aquele que lhe dê flexibilidade de tempo, proximidade da família ou outros fatores, esses fatores podem ser cruciais para a vida e felicidade pessoal, minha intenção não é subestimá-los. Por exemplo: se você quiser estar próximo de um parente doente, alguns pontos abaixo podem se tornar inviáveis.\n\n\n\nNetwork - rede de relacionamento\n\nConsidero esse item o mais importante em nosso relacionamento pessoal e profissional. Quando falamos de network estou falando das pessoas que trabalhamos e nos relacionamos em nosso dia-a-dia.\n\nDepois de um certo nível profissional é comum, pessoas trabalharem juntos em diversas empresas (entrar em uma nova empresa e com o tempo fazer proposta outros membros do ex-time). Se você tiver boas entregas e se juntar as pessoas certas, você terá mais oportunidades ao decorrer da sua vida profissional.\n\nEx: fazer parte da rede de relacionamento dos fundadores do PayPal vai expor você a empresas como LinkedIn, Yelp, Tesla, SpaceX, Facebook e muitas outras que estão por vir.\n\nDa mesma forma, ex-Googlers que se tornaram executivos ou VCs envolvidos com as principais empresas do Vale do Silício (_Facebook, Dropbox, Pinterest_, etc), elas agora conhecem pessoas em muitas grandes empresas de lá.\n\nAs pessoas que investiram, tornaram se sócias ou membro do conselho da empresa que você trabalha lhe conhecerá ao longo do tempo e impactara sua carreira. Fazer parte da rede certa no início da carreira lhe trará oportunidades interessantes. Podemos fazer que é _sorte_, acredito que podemos ter sorte, mas nem todas as pessoas estarão preparadas para abraçar a oportunidade (_sorte_) que passa em sua frente, não sabemos o momento que ela vai passar - você tem se preparado ou vai perder mais uma oportunidade?\n\nMercado e taxa de crescimento\n\nNo início de nossa carreira profissional, o mercado que escolhemos começar será um fator determinante para o seu sucesso profissional. Entrar em uma empresa com grande mercado lhe abrira diversas oportunidades de crescimento na empresa atual e outras empresas querendo lhe contratar - o que fazemos hoje colhemos no futuro.\n\nMuitos profissionais que passaram pela Netscape para o Google, do Google para o Facebook e agora do Facebook para outras empresas líderes da Internet. Traçando um paralelo: os profissionais que fizeram parte das empresas de telecomunicação nos anos 90 provavelmente ainda estão na Cisco (se não estudaram e tiveram _sorte_), tenha calma e escolha sabiamente o mercado que quer trabalhar.\n\nSei que no começo da nossa vida profissional só queremos qualquer emprego, mas tente pensar estrategicamente onde quer chegar, isso lhe ajudará dizer não para o que não faz sentido em sua vida profissional.\n\nTenha opções - seja flexível\n\nVocê tem ocupado sempre a mesma posição profissional? Ou pode estar uma posição que vai preparar você para uma nova posição?\n\nQual é a próximo cargo que você quer chegar? Você consegue trabalhar em um novo mercado (por exemplo, entrar na área farmacêutica) ou ocupar uma nova função (ocupar uma posição no time de produto ao invés de engenharia)?\n\nGeralmente nos limitamos fazendo a mesma coisa por diversas vezes, ao invés de aprender coisas novas (não é fácil sair da zona de conforto). Ser especialista é importante quando temos anos de experiência, não no começo de nossa vida profissional.\n\nMarca de peso - isso pode ser importante\n\nO nome da empresa que você trabalha é importante, principalmente se você nunca teve experiencia trabalhando em grandes times. Se você é formado em uma grande universidade (exemplo MIT) e trabalhou como engenheiro no Google, as pessoas vão assumir que você é um grande engenheiro, à reputação da instituição passará para você. Se você tiver 1 ou 2 marcas esse ponto é menos importante, eu olharia para os outros fatores listado acima.\n\n---\n\nPara o blogpost não ficar grande e com uma leitura massante quebrei ele em 2 partes (ainda não terminei de escrever a segunda, ou seja, pode ser que seja mais 😊).",
  "type" : "blog",
  "file-path" : "content/blog/2021-06-18-decisoes-na-carreira-de-engenharia-de-software-desenvolvimento.md"
}