{
  "title" : "Do querer fazer parte a CTO",
  "date" : "2022-06-02T00:00:00+00:00",
  "tags" : [ ],
  "url" : "https://avelino.run/do-querer-fazer-parte-a-cto",
  "content" : "Após ver a iniciativa que a Buser teve de formar pessoas em casa com o programa Buser Tech, eu quis me aproximar deles de alguma forma — não sabia como nem o que fazer, mas queria fazer parte da festa.\n\nAjudei muitas pessoas engenheiras evoluírem profissionalmente (mesmo que seja 0,001%), mas nunca formei ninguém do zero e senti estar no momento de aprender com quem está fazendo isso há alguns anos.\n\nConheço o @Tony há muitos anos e no final de 2021 tomei a liberdade de mandar mensagem para ele e expressar meu interesse.\n\nNão me sentia confortável de entrar na Buser para sugar conhecimento, então propus entrar no time de engenharia como desenvolvedor e acompanhar o que está rolando no Buser Tech.\n\nNo 1:1 com Tony ele compartilhou comigo que estava buscando alguém para assumir o papel de CTO na Buser. Confesso que não entendi porque ele estava compartilhando aquilo comigo, a única resposta que me veio no momento foi:\n\n> Sé você está falando isso para eu ser CTO você está falando para a pessoa errada.\n\nAo chegar e esbarrar com os softwares que desenvolvemos na Buser comecei a pensar como o pessoal que está no programa Buser Tech (com praticamente zero experiência em desenvolvimento de software) iria conseguir subir o ambiente de desenvolvimento que eu com alguns anos de experiência em engenharia estava com algumas fricções. Encarei isso como meu primeiro desafio de reduzir a fricção do onboarding do time de engenharia trazendo um olhar de developer experience.\n\nDepois de alguns dias/semanas senti que poderíamos melhorar nossa gestão de pessoas e projetos, corri para o papai Tony e me coloquei à disposição para ajudar como Tech Manager.\n\nO assunto de possivelmente ser CTO ficou na minha mente por dias e dias, cheguei a indicar um CTO para posição que infelizmente não deu match, mas vida que segue e meus monstros internos continuaram me assombrando sobre a posição de CTO.\n\nGeralmente quando tenho frio na barriga me soa que estou olhando para um grande desafio e existe um grande desconhecido — principalmente o que preciso evoluir como pessoa e gestor, nesse caso uma empresa com mais de 500 pessoas.\n\nApós empreender por alguns anos, não quero fazer uma empresa do zero até chegar em 500 pessoas (momento atual da Buser), mas tenho certeza que o desafio de ScaleUP de uma startup me leva mais próximo do meu objetivo profissional.\n\nMesmo com frio na barriga e julgar ser uma pessoa que precisa evoluir muito estou assumindo a posição de CTO da Buser.\n\nO Tony está saindo da buser? Não, ele está voltando para próximo do time de engenharia e educação — onde ele sente que entrega muito mais resultado para a empresa. Veja aqui a publicação que ele fez publicamente sobre esse movimento.",
  "type" : "blog",
  "file-path" : "content/blog/2022-06-02-do-querer-fazer-parte-a-cto.md"
}