{
  "title" : "Interactions: IRL vs. Social Media - What Really Matters?",
  "date" : "2024-06-09T00:00:00+00:00",
  "tags" : [ ],
  "url" : "https://avelino.run/interactions-irl-vs-social-media-what-really-matters",
  "content" : "These days, the line between our offline and online interactions is super blurry. But have you ever thought about what we actually remember from these interactions? Let’s dive into why a lot of our conversations and posts lose their importance over time.\n\nMemory in Real-Life Interactions\n\nDo you remember everything from your last hangout with friends? Probably not. An old study by Ebbinghaus (1885) showed that we forget info quickly if we don't reinforce it. Plus, Daniel Kahneman's book, Thinking, Fast and Slow, explains that our memory only keeps the stuff with the most emotional impact.\n\nSo, it's normal to remember the chats that had a special meaning at that time in your life. The rest, even if it was fun, just fades away.\n\nThe Past on Social Media\n\nOn social media, especially Twitter, this happens way faster. A tweet's life is basically a few minutes. A study by Wiselytics in 2014 found that most tweets lose their visibility in less than 20 minutes.\n\nBut still, we don’t delete our old posts. Why not? Maybe because these posts are like a public diary of our thoughts and experiences. Even when they’re irrelevant, they show how we’ve grown and changed.\n\nWhat Really Matters\n\nIf we forget most stuff in both real-life and online interactions, then what truly matters? Is it really necessary to keep a digital history? Or do these records have some symbolic value that still makes them part of who we are?\n\nThink about it: Do you remember every detail from your last friends' hangout? Or just what really mattered at that point in your life? And on social media, how many old tweets still mean something to you today?\n\nConclusion\n\nIn both real-life and social media interactions, we forget a lot of what we experience. What truly matters are the moments that leave a lasting impact. Understanding this helps us focus on what’s important and let the rest go.\n\n> This is the reason I don't keep a history of tweets on x.com, it doesn't make sense. What really matters is what is happening now, what is being discussed now. What was discussed yesterday no longer matters.",
  "type" : "blog",
  "file-path" : "content/blog/2024-06-09-interactions-irl-vs-social-media-what-really-matters.md"
}