{
  "title" : "Open Source como Bem Público: Alemanha e França já entenderam, e o Brasil?",
  "date" : "2026-02-04T00:00:00+00:00",
  "tags" : [ ],
  "url" : "https://avelino.run/open-source-bem-publico-brasil",
  "content" : "A Alemanha quer reconhecer open source como bem público. A França já dá incentivo fiscal. E o Brasil? O Brasil roda 90% da sua infraestrutura digital em cima de open source e finge que isso nasceu em árvore.\n\nNão precisa copiar a Alemanha. Mas precisa que a gente, que vive isso, assuma a responsabilidade de traduzir open source pra linguagem de negócio, de política pública, de impacto real.\n\nO que está acontecendo lá fora\n\nNa Alemanha, contribuidores lançaram uma petição para reconhecer oficialmente contribuições open source como voluntariado para o bem público. Isso habilitaria:\n\n- Reconhecimento fiscal, como isenções de impostos para voluntários\n- Proteção legal mais forte para contribuidores\n- Facilitação de status de organização sem fins lucrativos para projetos open source\n- Reembolso legal de despesas e emissão de recibos de doação\n\nNa França, já existe um sistema que permite que indivíduos reduzam seus impostos ao doar para associações reconhecidas como de interesse público.\n\nA pergunta que fica: se software é um bem público, contribuir para ele não deveria ser tratado como serviço público?\n\nE no Brasil?\n\nSe o mercado não valoriza, se o governo não reconhece, se a empresa não investe — é porque a gente não soube vender. A gente tratou open source como algo que quem é da área entende e esqueceu que valor que não é comunicado simplesmente não existe.\n\nMesmo sendo CTO _(poderia estar longe do código)_ contribuo com muitos projetos open source há anos. O que eu vejo na prática: empresas consomem open source como commodity, devs brasileiros talentosíssimos contribuem no tempo livre (leia-se: madrugada), e não existe nenhum reconhecimento institucional — nem fiscal, nem legal, nem cultural.\n\nA culpa é nossa também\n\nVou ser honesto: nós, engenheiros de software, falhamos em comunicar o valor do open source de forma que o resto do mundo entenda.\n\nA gente fala de _contribuição, comunidade, pull request_ — e o CEO, o investidor, o legislador não fazem a menor ideia do que isso significa na prática. Não sabem que aquela lib que sustenta o core do produto da empresa deles é mantida por um dev em Florianopolis às 2h da manhã.\n\nO que precisa mudar\n\nNão é sobre esperar o governo agir. É sobre nós, que vivemos open source, assumirmos a responsabilidade de traduzir esse valor para quem toma decisões.\n\n- Para o CEO: aquela lib que você usa de graça economiza meses de desenvolvimento e milhões em licenciamento\n- Para o investidor: open source é vantagem competitiva — empresas que contribuem atraem os melhores engenheiros\n- Para seu time: estragegia de atração e retenção de profissionais — cada pessoa se motiva por alguma coisa, open source pode e _é_ uma das coisas que sempre usei como estrategia de técnologia da empresas que passei\n- Para o legislador: 90% da infraestrutura digital brasileira depende de software mantido por voluntários sem nenhum suporte institucional\n\nEnquanto a Alemanha discute reconhecimento formal e a França já oferece incentivo fiscal, o Brasil segue consumindo open source como se fosse ar — essencial, mas invisível.\n\nA mudança começa quando a gente para de tratar open source como assunto técnico e começa a tratar como o que realmente é: infraestrutura crítica.\n\nPor que escrevi isso\n\nO Samuel Berthe publicou no LinkedIn sobre a petição alemã e o incentivo fiscal francês, e me marcou perguntando como era no Brasil. Ao invés de responder só num comentário, compartilhei minha opinião num post. Mas o LinkedIn tem alcance limitado e conteúdo efêmero — resolvi transformar em blogpost para que a opinião fique acessível de verdade.",
  "type" : "blog",
  "file-path" : "content/blog/2026-02-open-source-bem-publico-brasil.md"
}