{
  "title" : "The open source governance model as a reference for leading engineering teams",
  "date" : "2025-10-02T00:00:00+00:00",
  "tags" : [ ],
  "url" : "https://avelino.run/open-source-governance-reference-leading-engineering-teams",
  "content" : "Technology leadership is at a breaking point. The traditional command-and-control model, born in the industrial era, is cracking under the adaptive complexity of engineering teams. Rajeev Peshawaria opens his book Open Source Leadership with a pointed provocation:\n\n> “Leadership can no longer be about command and control. It must be about influence and inspiration.”\n\nIf projects like Linux, Kubernetes, and Apache were built by distributed communities with open governance and without rigid hierarchical structures, why do corporate engineering leaders still cling to old models?\n\n\n\nThe crisis of the traditional model: what organizational science shows us\n\nOrganizational science has already accumulated evidence against command-and-control.\n\n- Psychological Safety: Amy Edmondson showed in her seminal study that teams with higher psychological safety share mistakes, learn faster, and perform better (PDF – MIT). Recent studies reinforce this effect as a buffer against burnout (PMC 2024), and there is already work linking psychological safety to the software engineering environment (arXiv 2025).\n\n- Hackman and team effectiveness: Richard Hackman proposed that high-performing teams depend on five conditions: clear purpose, well-defined boundaries, consistent norms and roles, organizational support, and competent coaching (Hackman – What Makes for a Great Team).\n\nThese findings already show that rigid environments, based on fear or hierarchy alone, destroy performance. This is where open source logic comes in as a viable alternative.\n\nOpen source governance: mechanisms that work\n\nOSS governance survives at global scale because it created institutional coordination mechanisms:\n\n- Radical transparency: issues, PRs, and decisions are public. As Peshawaria says:\n  > “In a transparent world, secrecy is the enemy of trust. Leadership today is about being open, even when it is uncomfortable.”\n  This visibility accelerates learning and collective trust.\n\n- Technical meritocracy (broadened):\n  > “Open source leadership is about democratizing power, but not equalizing it. Influence flows to those who add the most value.”\n  Studies show that leadership in OSS emerges not only from technical contribution but also from communication skills and community influence (arXiv – Follow the Leader, 2022). In other words, technical merit matters, but reputation and social capital coexist.\n\n- Autonomy with accountability: the fork symbolizes maximum freedom but carries the cost of maintenance. This mechanism regulates autonomy. In companies, the parallel is to allow squads to explore alternatives, as long as they own outcome and integration metrics.\n\nThese mechanisms echo Hackman’s conditions: purpose, norms, boundaries, and support. OSS applies them in a radical way; corporations can use them as an adapted reference.\n\nHow I think: a CTO and maintainer’s critical reading\n\nMy experience connects both worlds: OSS and corporate management.\n\n- Documented decisions: in communities, PRs function as a public court. At Buser and in OSS projects, adopting open RFCs helped me create legitimacy and institutional memory.\n- Fluid leadership: in OSS, leadership is emergent and temporary. In corporate settings, adopting this flow — specialists taking on roles according to context — works better than fixing authority. Peshawaria sums it up:\n  > “The open source world thrives because leadership is temporary, emergent, and conditional upon contribution.”\n- Burnout and centralization: both in OSS and in corporations, when a few people concentrate critical responsibilities, the result is exhaustion. The path is always to distribute leadership.\n\nOSS is a mirror: it shows that teams can function without rigid hierarchy, as long as they have purpose, transparency mechanisms, and healthy meritocracy.\n\nConclusion\n\nOpen source is not romanticism; it is the largest social laboratory of technology governance in history. If volunteer communities created systems that sustain the internet, there is no excuse for corporate teams to remain stuck in the 1920 model.\n\nThe central lesson is clear: engineering leadership is not HR resource control, but building systems where autonomy, purpose, and accountability can flourish.\n\nThis is the reference. The rest is an illusion of control.\n\n---\n\nExternal references cited\n\n- Edmondson, A. (1999). Psychological Safety and Learning Behavior in Work Teams\n- Ma, J. et al. (2024). The impact of psychological safety on employees’ well-being and performance\n- Hackman, J. (2004). What Makes for a Great Team\n- Maltby, A. et al. (2022). Follow the Leader: Technical and Inspirational Leadership in OSS\n- Edmondson, A. et al. (2025). Psychological Safety in Software Engineering Teams",
  "type" : "blog",
  "file-path" : "content/blog/2025-10-open-source-governance-reference-leading-engineering-teams.md"
}