{
  "title" : "Reporting a problem in an Open Source project is as important as contributing code",
  "date" : "2023-04-22T00:00:00+00:00",
  "tags" : [ ],
  "url" : "https://avelino.run/reporting-problem-in-open-source-project-is-important-contributing-code",
  "content" : "I constantly hear people saying that to contribute to an Open Source project you need to be able to program very well, have a lot of knowledge, be able to handle code criticism, etc.\n\n> I see the above statements as excuses and focus in the wrong place.\n\nIn the last few months, I haven't had as much time to contribute to open source projects as I like (writing code), but that didn't stop me from contributing. Actually, the lack of priority (not lack of time) has made me contribute by reporting problems that I run into in the projects/software I use in my day-to-day life and this has been more work than writing code with a defined specification (issue that someone invested time detailing).\n\nGenerally, reporting a problem is not just opening an issue exposing the back trace, we need to understand what generated the problem, so the person who helps to maintain the project can reproduce it locally (in the development environment) to think of the best solution without breaking other existing features in the software.\n\nHow do I write a very detailed issue?\n\nWhenever I am communicating with someone, I assume that everything that is obvious to me is not so obvious to the person and I put as much context as possible in the conversation, helping the person to make the best decision.\n\nWhen I am opening an issue it is no different, I will describe the problem to the person who will read (solve) it, not to me, i.e. everything that is obvious to me is probably not obvious to other people.\n\nCode is important, but not only code\n\nOpen Source projects exist to solve problems and are made by people for people, investing time in opening a detailed issue demonstrates that you care about the project and empathize with the people who are helping to maintain the project.\n\nAvoid leaving to report the issue later, you will probably forget important details.\n\n> this blogpost came up after I reported an issue in a project and the first comment was from a person saying he had run into the same problem yesterday.\n> what came to my mind was: why didn't the person report this issue yesterday?\n\nQuery that I am constantly following on GitHub to keep track of the issues I opened, looking today there are 1.1k issues in public repositories.",
  "type" : "blog",
  "file-path" : "content/blog/2023-04-22-reporting-problem-in-open-source-project-is-important-contributing-code.md"
}