{
  "title" : "The Power of Writing in English for the Global Open Source Community",
  "date" : "2023-10-24T00:00:00+00:00",
  "tags" : [ ],
  "url" : "https://avelino.run/the-power-of-writing-in-english-for-the-global-open-source-community",
  "content" : "In today’s interconnected world, writing in English for the open source community has become a pivotal step for many professionals. It’s not just about language proficiency; it’s about bridging gaps, fostering collaboration, and amplifying the impact of open source projects on a global scale.\n\nThe Journey to Global Connection\n\nIt’s often said that taking the first step is the hardest. For many, including myself, the decision to write in English was a calculated one, influenced by the desire to connect with a broader audience and the recognition of English as a common language in the tech world. This step, although seemingly daunting, is crucial for one’s professional trajectory.\n\n> Embracing a world-class mindset means sometimes being _“selfish”_ with our careers, prioritizing growth and global reach.\n\nThe Essence of Writing in English\n\nWhy the emphasis on English? The answer lies in the heart of the open source community. Writing in English allows for a deeper connection with those who maintain, contribute, and benefit from free open source software (FOSS). Since my early days in 2008, I’ve been an active contributor to various open source projects. By 2015, I found myself maintaining projects that thousands rely on.\n\n> A quick glance at my GitHub account (@avelino) reveals a story of dedication and passion for open source contributions.\n\nWhat Lies Ahead?\n\nChange is the only constant. While the medium of communication might shift to English, the essence remains unchanged. As a technology executive and CTO at a prominent startup in Brazil, my commitment to sharing knowledge, insights, and experiences remains unwavering. The goal is simple: to add value to your professional journey.\n\n---\n\nFor any clarifications, suggestions, or feedback, please feel free to reach out.",
  "type" : "blog",
  "file-path" : "content/blog/2023-10-24-the-power-of-writing-in-english-for-the-global-open-source-community.md"
}