{
  "title" : "\"Why We Changed the Site's Color Palette — Making Reading a More Pleasant Experience\"",
  "date" : "2025-04-02T00:00:00+00:00",
  "tags" : [ "UX", "usability", "design", "color palette", "color psychology", "accessibility", "reading", "UI", "frontend" ],
  "url" : "https://avelino.run/why-we-changed-the-site-color-palette-2025",
  "content" : "If you’ve visited avelino.run recently, you may have noticed: the visual vibe is softer, calmer — and that’s completely intentional.\n\nWe redesigned the site’s color palette with one goal in mind: to make your reading experience more comfortable. And yes, there’s science behind it.\n\n\n\n🧠 The Psychology of Color and Visual Fatigue\n\nStudies in interface design and cognitive neuroscience show that pure white backgrounds and high-contrast elements can cause eye strain during extended reading sessions. A study published in the International Journal of Human-Computer Studies points out that soft, lightly tinted backgrounds can reduce visual stress and help readers stay focused for longer.\n\nSo we replaced the pure white background with #FAF3FA, a soft lavender tone that keeps the clarity of white while being easier on the eyes.\n\n🎨 The New Color Palette\n\nOur focus was to create a harmonious, accessible experience with a modern and welcoming vibe. Here's the palette:\n\n- Background: #FAF3FA – soft lavender that diffuses light and reduces glare.\n- Main Text: #4A4A4A – dark gray for clean, high-contrast readability without harshness.\n- Links and Highlights: #E6E6FA – a soft lavender accent that complements the background.\n- Buttons/CTAs: #BA55D3 – a vibrant purple for elements that need to stand out.\n- Borders/Dividers: #E0E0E0 – light gray to organize content gently and subtly.\n\n💡 Our Goal Is Simple\n\nWe want reading on this site to feel as effortless as a good conversation. No fatigue. No distraction. Just clarity, flow, and focus.\n\n---\n\nReference:\nBauerly, M., & Liu, Y. (2006). Computational modeling and experimental investigation of effects of compositional elements on interface and design aesthetics. International Journal of Human-Computer Studies, 64(8), 670–682.",
  "type" : "blog",
  "file-path" : "content/blog/2025-04-02-why-we-changed-the-site-color-palette.md"
}